<!-- terraform-plan-comment -->
## Terraform Plan

<details>
<summary>Click to expand plan output</summary>

```hcl
google_compute_managed_ssl_certificate.app_cert: Refreshing state... [id=projects/fenrir-ledger-prod/global/sslCertificates/fenrir-app-cert]
google_project_iam_member.deploy_firestore: Refreshing state... [id=fenrir-ledger-prod/roles/datastore.owner/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_service_account.app_workload: Refreshing state... [id=projects/fenrir-ledger-prod/serviceAccounts/fenrir-app-workload@fenrir-ledger-prod.iam.gserviceaccount.com]
data.google_project.project: Reading...
google_service_account.agents_workload: Refreshing state... [id=projects/fenrir-ledger-prod/serviceAccounts/fenrir-agents-workload@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_service.apis["firestore.googleapis.com"]: Refreshing state... [id=fenrir-ledger-prod/firestore.googleapis.com]
google_project_service.apis["iam.googleapis.com"]: Refreshing state... [id=fenrir-ledger-prod/iam.googleapis.com]
google_project_service.apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=fenrir-ledger-prod/cloudresourcemanager.googleapis.com]
google_project_service.apis["firebaserules.googleapis.com"]: Refreshing state... [id=fenrir-ledger-prod/firebaserules.googleapis.com]
google_project_service.apis["logging.googleapis.com"]: Refreshing state... [id=fenrir-ledger-prod/logging.googleapis.com]
google_project_service.apis["billingbudgets.googleapis.com"]: Refreshing state... [id=fenrir-ledger-prod/billingbudgets.googleapis.com]
google_project_service.apis["dns.googleapis.com"]: Refreshing state... [id=fenrir-ledger-prod/dns.googleapis.com]
google_project_service.apis["container.googleapis.com"]: Refreshing state... [id=fenrir-ledger-prod/container.googleapis.com]
data.google_project.project: Read complete after 0s [id=projects/fenrir-ledger-prod]
google_project_service.apis["monitoring.googleapis.com"]: Refreshing state... [id=fenrir-ledger-prod/monitoring.googleapis.com]
google_project_service.apis["compute.googleapis.com"]: Refreshing state... [id=fenrir-ledger-prod/compute.googleapis.com]
google_project_iam_member.deploy_roles["roles/iam.serviceAccountAdmin"]: Refreshing state... [id=fenrir-ledger-prod/roles/iam.serviceAccountAdmin/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_service.apis["artifactregistry.googleapis.com"]: Refreshing state... [id=fenrir-ledger-prod/artifactregistry.googleapis.com]
google_project_iam_member.deploy_roles["roles/compute.networkAdmin"]: Refreshing state... [id=fenrir-ledger-prod/roles/compute.networkAdmin/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/firebaserules.admin"]: Refreshing state... [id=fenrir-ledger-prod/roles/firebaserules.admin/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/artifactregistry.admin"]: Refreshing state... [id=fenrir-ledger-prod/roles/artifactregistry.admin/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/monitoring.admin"]: Refreshing state... [id=fenrir-ledger-prod/roles/monitoring.admin/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/compute.loadBalancerAdmin"]: Refreshing state... [id=fenrir-ledger-prod/roles/compute.loadBalancerAdmin/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/compute.securityAdmin"]: Refreshing state... [id=fenrir-ledger-prod/roles/compute.securityAdmin/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/container.admin"]: Refreshing state... [id=fenrir-ledger-prod/roles/container.admin/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/dns.admin"]: Refreshing state... [id=fenrir-ledger-prod/roles/dns.admin/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/certificatemanager.editor"]: Refreshing state... [id=fenrir-ledger-prod/roles/certificatemanager.editor/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/container.developer"]: Refreshing state... [id=fenrir-ledger-prod/roles/container.developer/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/logging.admin"]: Refreshing state... [id=fenrir-ledger-prod/roles/logging.admin/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=fenrir-ledger-prod/roles/iam.serviceAccountUser/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/resourcemanager.projectIamAdmin"]: Refreshing state... [id=fenrir-ledger-prod/roles/resourcemanager.projectIamAdmin/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.agents_logging: Refreshing state... [id=fenrir-ledger-prod/roles/logging.logWriter/serviceAccount:fenrir-agents-workload@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.agents_monitoring: Refreshing state... [id=fenrir-ledger-prod/roles/monitoring.metricWriter/serviceAccount:fenrir-agents-workload@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.agents_storage: Refreshing state... [id=fenrir-ledger-prod/roles/storage.objectAdmin/serviceAccount:fenrir-agents-workload@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.app_monitoring: Refreshing state... [id=fenrir-ledger-prod/roles/monitoring.metricWriter/serviceAccount:fenrir-app-workload@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.app_logging: Refreshing state... [id=fenrir-ledger-prod/roles/logging.logWriter/serviceAccount:fenrir-app-workload@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.app_firestore: Refreshing state... [id=fenrir-ledger-prod/roles/datastore.user/serviceAccount:fenrir-app-workload@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.app_storage_reader: Refreshing state... [id=fenrir-ledger-prod/roles/storage.objectViewer/serviceAccount:fenrir-app-workload@fenrir-ledger-prod.iam.gserviceaccount.com]
google_compute_global_address.monitor_ip: Refreshing state... [id=projects/fenrir-ledger-prod/global/addresses/monitor-ip]
google_compute_global_address.app_ip: Refreshing state... [id=projects/fenrir-ledger-prod/global/addresses/fenrir-app-ip]
google_firebaserules_ruleset.firestore: Refreshing state... [id=projects/fenrir-ledger-prod/rulesets/627f2f9f-3c91-44be-9ddc-805c908cafba]
google_compute_network.vpc: Refreshing state... [id=projects/fenrir-ledger-prod/global/networks/fenrir-vpc]
google_dns_managed_zone.app: Refreshing state... [id=projects/fenrir-ledger-prod/managedZones/fenrirledger-com]
google_monitoring_uptime_check_config.app_health: Refreshing state... [id=projects/fenrir-ledger-prod/uptimeCheckConfigs/fenrir-app-health-check-KSS8KO1ZjAQ]
google_artifact_registry_repository.images: Refreshing state... [id=projects/fenrir-ledger-prod/locations/us-central1/repositories/fenrir-images]
google_monitoring_notification_channel.email: Refreshing state... [id=projects/fenrir-ledger-prod/notificationChannels/18175132539659565094]
google_firestore_database.main: Refreshing state... [id=projects/fenrir-ledger-prod/databases/fenrir-ledger-prod]
google_compute_global_address.umami_ip: Refreshing state... [id=projects/fenrir-ledger-prod/global/addresses/umami-ip]
google_dns_record_set.marketing: Refreshing state... [id=projects/fenrir-ledger-prod/managedZones/fenrirledger-com/rrsets/marketing.fenrirledger.com./A]
google_dns_record_set.monitor: Refreshing state... [id=projects/fenrir-ledger-prod/managedZones/fenrirledger-com/rrsets/monitor.fenrirledger.com./A]
google_compute_router.router: Refreshing state... [id=projects/fenrir-ledger-prod/regions/us-central1/routers/fenrir-router]
google_compute_subnetwork.subnet: Refreshing state... [id=projects/fenrir-ledger-prod/regions/us-central1/subnetworks/fenrir-subnet]
google_compute_firewall.allow_health_checks: Refreshing state... [id=projects/fenrir-ledger-prod/global/firewalls/fenrir-allow-health-checks]
google_artifact_registry_repository_iam_member.deploy_writer: Refreshing state... [id=projects/fenrir-ledger-prod/locations/us-central1/repositories/fenrir-images/roles/artifactregistry.writer/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_artifact_registry_repository_iam_member.agents_reader: Refreshing state... [id=projects/fenrir-ledger-prod/locations/us-central1/repositories/fenrir-images/roles/artifactregistry.reader/serviceAccount:fenrir-agents-workload@fenrir-ledger-prod.iam.gserviceaccount.com]
google_artifact_registry_repository_iam_member.gke_reader: Refreshing state... [id=projects/fenrir-ledger-prod/locations/us-central1/repositories/fenrir-images/roles/artifactregistry.reader/serviceAccount:fenrir-app-workload@fenrir-ledger-prod.iam.gserviceaccount.com]
google_dns_record_set.www: Refreshing state... [id=projects/fenrir-ledger-prod/managedZones/fenrirledger-com/rrsets/www.fenrirledger.com./A]
google_dns_record_set.apex: Refreshing state... [id=projects/fenrir-ledger-prod/managedZones/fenrirledger-com/rrsets/fenrirledger.com./A]
google_firebaserules_release.firestore: Refreshing state... [id=projects/fenrir-ledger-prod/releases/cloud.firestore]
google_monitoring_alert_policy.container_restarts: Refreshing state... [id=projects/fenrir-ledger-prod/alertPolicies/17528829657638754257]
google_dns_record_set.analytics: Refreshing state... [id=projects/fenrir-ledger-prod/managedZones/fenrirledger-com/rrsets/analytics.fenrirledger.com./A]
google_compute_router_nat.nat: Refreshing state... [id=fenrir-ledger-prod/us-central1/fenrir-router/fenrir-nat]
google_container_cluster.autopilot: Refreshing state... [id=projects/fenrir-ledger-prod/locations/us-central1/clusters/fenrir-autopilot]
google_monitoring_alert_policy.uptime_failure: Refreshing state... [id=projects/fenrir-ledger-prod/alertPolicies/2962841758214709531]
google_service_account_iam_member.agents_workload_identity: Refreshing state... [id=projects/fenrir-ledger-prod/serviceAccounts/fenrir-agents-workload@fenrir-ledger-prod.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/serviceAccount:fenrir-ledger-prod.svc.id.goog[fenrir-agents/fenrir-agents-sa]]
google_service_account_iam_member.app_workload_identity: Refreshing state... [id=projects/fenrir-ledger-prod/serviceAccounts/fenrir-app-workload@fenrir-ledger-prod.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/serviceAccount:fenrir-ledger-prod.svc.id.goog[fenrir-app/fenrir-app-sa]]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_compute_global_address.marketing_ip will be created
  + resource "google_compute_global_address" "marketing_ip" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + effective_labels   = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "marketing-ip"
      + prefix_length      = (known after apply)
      + project            = "fenrir-ledger-prod"
      + self_link          = (known after apply)
      + terraform_labels   = (known after apply)
    }

  # google_dns_record_set.marketing will be updated in-place
  ~ resource "google_dns_record_set" "marketing" {
        id           = "projects/fenrir-ledger-prod/managedZones/fenrirledger-com/rrsets/marketing.fenrirledger.com./A"
        name         = "marketing.fenrirledger.com."
      ~ rrdatas      = [
          - "107.178.250.240",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

**Commit:** `cc3b600`